Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: If they identify a dependency resulting in a licensing conflict, the OSRB Chair will issue a ticket to Engineering to resolve the dependency problem by reworking the source code.
ja: もしライセンスの矛盾になるような依存関係を発見した場合、コンプライアンス オフィサーは、ソース コードの再作業によって依存関係問を題解決するためにチケットを技術担当に発行する。

source: If third-party software includes open source, Supply Chain must ensure that open source license obligations are satisfied, since, after initial ingress, those obligations become your responsibility as distributor of a product or service that includes open source.
ja: もしサードパーティのソフトウェアがオープンソースを含んでいたならば、サプライチェーン部門 はオープンソースライセンス上の義務が確実に満たされるようにしなければなりません。

source: If you are making GPL/LGPL licensed code available, ensure you are providing and documenting the modifications you have introduced.
ja: もし、GPL/LGPLで許諾されたコードを開示するのであれば、自分たちが加えた変更について、コードと文書を提供することを確実にします。

source: If you are providing a patch, ensure that it applies cleanly and that you have specified the proper version of the upstream component.
ja: もし、パッチを提供する時には、それが容易に適用できること、アップストリーム コンポーネントの適切なバージョンを特定していることを確認します。

source: If you do not start with that high-level consensus, driving agreement on the details of the policy and on investments in the process tends to be very hard, if not impossible.
ja: こうしたハイレベルなコンセンサスに基づかずにポリシーやプロセス の実装の細部について社内合意しようとすると、不可能とは言わないまでも非常な困難に直面します。

source: If you follow a conservative approach with your compliance practices, you would approve open source software for a specific version and usage in a specific product or service version.
ja: 保守的なアプローチの後にコンプライアンス プラクティスを進めるならば、特定のバージョンと、特定の製品やサービスバージョンでの利用に対して、オープン ソース ソフトウェアを承認します。

source: If you opt for providing the source code on a CD-ROM, this will introduce some additional cost to you and additional verification steps to ensure the correctness of the process of burning the CD-ROM containing the source code packages.
ja: CD-ROMでのソース コード頒布を選んだ場合には、追加のコストがかかりますし、ソース コード パッケージを格納したCD-ROMを生成するプロセスを確認する追加の検証ステップも必要になります。

source: If, for instance, the source code scanning tool identifies the use of unauthorized GPL licensed source code (a snippet) within a proprietary component, this will be reported to Engineering with a request for correction.
ja: 例えば、ソース コード スキャン ツールが、プロプライエタリ コンポーネントの中に未承認のGPL許諾されたソース コード（コード断片）の利用を発見したならば、このことについて、技術担当に訂正要求を提出します。

source: Implementation of open source compliance processes can vary across organizations based on a number of factors including the underlying development processes into which compliance must fit, the size and nature of the code base, the number of products or services involved, the amount of externally supplied code, the size and organizational structure, and so on.
ja: オープン ソース コンプライアンス プロセスの実現は、コンプライアンスを組み込む必要がある開発プロセス、コードのサイズと数、関連する製品とサービスの数、外部から導入されたコード量、組織のサイズや体制など、多くの要因に基づいて、組織ごとに変化します。

source: Improve
ja: 改善

source: Improve 124
ja: 改善 124

source: Improve the relationship with developers in the various open source projects used by your organization
ja: 組織で利用している様々なオープン ソース プロジェクトの開発者との関係を改善します。

source: In a later chapter, we discuss a simple process for managing open source compliance inquiries.
ja: 後ろの章で、オープンソース コンプライアンスに対する照会を扱うシンプルなプロセスについて述べます。

source: In addition to the responsibilities pertaining to the OSRB, the Compliance Officer carries the following duties:
ja: OSRBに帰属する責任に加え、コンプライアンスオフィサーは以下の義務がある。

source: In addition, IT may receive requests from the OSRB to develop and/ or acquire tools that will be used to improve effectiveness the compliance activities.
ja: さらにIT部門はOSRBからコンプライアンス活動の効率向上のためのツールの開発や調達を要請されることもあります。

source: In addition, IT may receive requests from the OSRB to develop and/or acquire tools that will be used to improve effectiveness the compliance activities.
ja: さらにIT部門はOSRBからコンプライアンス活動の効率向上のためのツールの開発や調達を要請されることもあります。

source: In addition, compliance activities can also help identify crucial pieces of open source that are in use across multiple products and parts of an organization, and/or are highly strategic and beneficial to that organization.
ja: 更に、コンプライアンスの活動は、様々な製品や部門で使われていてカギとなる、組織にとって高度に戦略的で利益をもたらすオープンソース ソフトウェアの洗い出しにつながります。

source: In addition, if there is source code licensed under one of the GPL/LGPL family of licenses, a written offer needs to be provided along with information on how to obtain the source code.
ja: これに加え、GPL/LGPLファミリのライセンスのいずれかに従ってソースコードがライセンスされるならば、ソースコードを得る方法の情報を書面で提供する必要があります。

source: In addition, specific to the GPL/LGPL family of licenses, provide a written offer on how to obtain the source code, when applicable.
ja: またGPL/LGPLファミリのライセンスの場合には、可能であれば ソースコードを得る方法を書面にします。

source: In addition, the OSRB should educate employees on some of the most common open source licenses and the issues surrounding using open source in commercial contexts.
ja: 更に、OSRBは最も広く利用されるいくつかのオープンソースのライセンス、商用でのオープンソース利用に関わる話題についても教育すべきです。

source: In addition, the acquiring company may include provisions in the purchase agreement requiring the disclosure of open source that is subject to the transaction.
ja: これに加え、買収側の企業は買収の合意文書にオープンソースについての開示の条項を入れることも考えられます。

source: In addition, we will give priority to using open source software as we design now solutions.”
ja: 加えて、自分たちが設計したソリューションとしてのオープン ソース ソフトウェアを優先的に利用していきます。

source: In addition, we will give priority to using open source software as we design now solutions.” Office of the CIO, U.S.
ja: 加えて、自分たちが設計したソリューションとしてのオープン ソース ソフトウェアを優先的に利用していきます。」 CIOオフィス,

source: In addition, with the specific cases of the GPL/LGPL family of licenses, the written offer to access the source code must be valid for three years.
ja: 加えて、GPL/LGPL系のライセンスに特有のケースとして、書面による通知は3年間有効でなければなりません。

source: In almost all cases, the failure to comply with open source license obligations has also resulted in public embarrassment, negative press, and damaged relations with the open source community.
ja: ほぼすべての事件において、オープンソース ライセンス上の義務違反は面目の失墜、否定的な記事、オープンソース コミュニティとの関係悪化を招いています。

source: In an effort to reduce the number of questions received by Legal Counsel and to increase license and compliance process education, some companies opt to classify the most-used licenses in their products under a handful of categories.
ja: 法務担当が受ける質問数を減らし、ライセンスとコンプライアンス プロセス教育を増やすために、いくつかの会社では製品に使用する最もよく利用するライセンスをいくつかのカテゴリに分類しています。

source: In every case, when an OSRB member discovers a compliance issue in the software component, the component goes through the same life cycle:
ja: OSRBメンバーがソフトウェア コンポーネント中にコンプライアンスに関する課題を発見したような全てのケースは、コンポーネントは同じライフ サイクルを進みます。

source: In fact, many of the steps are identical, but on a smaller, incremental scale.
ja: 実際には踏むべきステップの多くは同じで、ただし規模は小さく、積み増しとなります。

source: In larger organizations, the compliance officer and related roles may grow to be FTEs (full time equivalents); in smaller organizations, the responsibility of open source management is more likely to be a shared and/or a part-time activity.
ja: 大きな組織ではコンプライアンス オフィサー、および関連する職務はフルタイムの仕事となり得ます。小さい組織では分担したり、時間の一部を割くべき活動となる可能性が高いです。

source: In most cases, if a software component reaches the final review, it will be approved unless a condition has presented itself (such as the software component no longer being in use).
ja: ほとんどのケースでは、ソフトウェア コンポーネントが最終レビューの段階まで到達したら、（そのソフトウェア コンポーネントがもう使われていないなどの）何かの条件が現れない限り、そのコンポーネントは承認されます。

source: In most cases, open source projects maintain a file called AUTHORS that includes the list of contributors; you can use this information as part of the attribution notice.
ja: ほとんどの場合、オープン ソース プロジェクトは、貢献者のリストを含むAUTHORSと呼ばれるファイルを含んでいますので、帰属表記の一部としてこの情報を使うことができます。

source: In most cases, the individual fulfills the role of Manager or Director of Open Source.
ja: 大抵の場合、オープンソース部門の部長や所長が役割を果たします

source: In order to fulfill documentation obligations, appropriate notices must be included with the product.
ja: ドキュメント記載義務を履行するには、製品に適切な通知を含める必要があります。

source: In parallel, engineering and product teams have several responsibilities with respect to open source compliance:
ja: これと並行し、エンジニアリングと製品のチームはオープンソースのコンプライアンスについていくつかの責任を負います。

source: In preparation for legal review, the individual who runs the source code scan should attach to the compliance ticket all the license information found in the package, such as any COPYING, README, or LICENSE files, in addition to any files stating copyright and attribution notices.
ja: 法務レビューへの準備中に、ソース コード スキャンを実施する担当者は、著作権や帰属を表記しているファイルに加えて、COPYING, README, LICENSEファイルなど、パッケージで見つかった全てのライセンス情報をコンプライアンス チケットに付けておくべきです。

source: In preparation for the legal review, it is best to provide attorneys with all discovered licensing information for specific components:
ja: 法務レビューの準備としては、特定のコンポーネントに対して発見されたライセンス情報の全てを、法務担当に提供するのが最も良い方法です。

source: In preparation for the legal review, it is best to provide attorneys with all discovered licensing information for specific components: .
ja: 法務レビューの準備としては、特定のコンポーネントに対して発見されたライセンス情報の全てを、法務担当に提供するのが最も良い方法です。

source: In reality, it is not all that difficult, because you do not have to implement all elements simultaneously.
ja: 実際にはそこまで難しいものではありません。すべての要素を同時に実装しなければならない訳ではないからです。

source: In some cases, a code rework is needed; in other cases, it may simply be a matter of clarification.
ja: ある場合にはコードの再作業が必要となりますし、別の場合には単に状況を明確にするだけで解決することもあります。

source: In some cases, if the licensing information is not clear or if it is not available, the legal counsel contacts the project maintainer or the open source developer to clarify the ambiguities and to receive a confirmation of the license under which that specific software component is licensed.
ja: ライセンス情報が不明確である、ライセンス情報が入手できない等、いくつかの場合には、法務担当は、不明瞭な点を明確にするとともに特定のソフトウェアに付与されているライセンスの確認をするために、プロジェクトのメインテナーやオープン ソース開発者にコンタクトします。

source: In some cases, it will make sense to require third-party software vendors to provide an audit of the supplied code as an additional layer of diligence.
ja: あるケースでは、精査の追加として、供給コードの監査結果をサード パーティ ソフトウェア ベンダーに要求することも意味があります。

source: In some cases, pay an undisclosed amount of financial consideration to the plaintiffs.
ja: いくつかの事件では、原告に対し非開示の額の金銭的対価

source: In some cases, specifically when a full platform scan is done, an open source component may be scanned before having a proper compliance report.
ja: ある場合には、特にプラットフォームのフル スキャンが実施される時、適切なコンプライアンス報告が作成される前に、オープン ソース コンポーネントはスキャンされることもあります。

source: In some cases, the compliance due diligence may result in a decision not to proceed with the transaction, if that the compliance situation proves far from ideal.
ja: 時にはコンプライアンス上の精査の結果、コンプライアンスの状況が理想からかけ離れており、ためにその活動を止める決定をする場合もあります。

source: In some cases, the instant compliance method can be accomplished by including the source code packages on the product/device in a media directory.
ja: あるケースでは、即時コンプライアンス方法は、メディアのディレクトリproduct/deviceにソース コードを含めることで、達成することができます。

source: In some cases, the open source license does not include an obligation to make your modifications available for license compliance purposes.
ja: あるケースでは、オープン ソース ライセンスは、ライセンス コンプライアンスの目的からすると、修正を開示する義務を含んでいません。

source: In some cases, when the incoming license is a permissive license that allows relicensing (such as BSD), companies will relicense that software under their own proprietary license.
ja: あるケースでは、入るライセンスが（BSDのように）再許諾を許すような許容型ライセンスである場合には、企業はそのソフトウェアをプロプライエタリ ライセンスで再許諾します。

source: In some companies, there is no distinction between engineering and product teams.
ja: 企業によってはエンジニアリングと製品のチームは分かれていない

source: In some instances, such as with mobile phones or tablets, manufacturers are able to provide the notices on the actual device via a web browser or a PDF viewer (i.e., licensing text is available on the device either in HTML or PDF format).
ja: 携帯電話やタブレットなど、いくつかの例では、製造会社は、ウェブ ブラウザやPDFビューアを使って（ライセンス文は、HTMLやPDF形式で機器上で利用可能です）、実際の機器上で通知を提示することができます。

source: In some instances, the Compliance Officer presents on organization compliance efforts, rules, policies, and processes to all new employees as part of the new employee orientation session.
ja: いくつかの例では、コンプライアンス オフィサーが、企業のコンプライアンスに関する努力や規則、ポリシー、そしてプロセスをオリエンテーションの一部として新規従業員に説明します。

source: In such a dynamic environment, a compliance program must evolve as well.
ja: こうしたダイナミックな環境の中で、コンプライアンス プログラムも進化する必要があります。

source: In the architecture review, the compliance officer and the engineering OSRB representative perform an analysis of the interaction between the open source, proprietary, and third-party code.
ja: アーキテクチャー レビューの中では、コンプライアンス オフィサーとOSRB技術代表は、オープン ソースとプロプライエタリ、およびサード パーティ コードの間の相互関係を解析します。

source: In the case of open source compliance, due diligence is required to ensure the following:
ja: オープン ソース コンプライアンスのこのケースでは、精査は、以下の項目の確認を要求されるものとします；

source: In the event of a compliance challenge, such a program can demonstrate an ongoing pattern of acting in good faith.
ja: コンプライアンス上の問題が生じた時、そうしたプログラムは会社が善意であることを示すことができます。

source: In the event that engineering insists on keeping the proprietary source code in the open source component, the OSEC will have to release the proprietary source code under an open source license.
ja: 技術担当がオープン ソース コンポーネント中にプロプライエタリ ソース コードを保持し続けることを固辞した場合には、OSECはプロプライエタリ ソース コードをオープン ソース ライセンスの下でリリースする決定をしなければならなくなるでしょう。

source: In the event that the architecture review reveals any linkage issue (i.e., a static or dynamic linkage that does not follow company policy as defined in the linkage matrices), then the person responsible for driving the architecture review (usually the compliance officer) would notify the software developer responsible for that software component and request a correction.
ja: アーキテクチャー レビューによってリンクに関する課題（リンク マトリックスで示される企業ポリシーに従わない動的リンク静的リンクなど）が発見されたとき、アーキテクチャー レビューを推進した責任者（通常はコンプライアンス オフィサー）は、ソフトウェア コンポーネントに責任を持つソフトウェア開発者に通知して、改善を要求します。

source: In the following sections, we discuss some of the most common challenges, and offer recommendations on how to overcome them.
ja: 以下の節では最もありふれた困難を取り上げ、克服する方法を示唆します。

source: In the following sections, we examine these five pieces of advice, provide examples, and discuss how they help software developers working with open source.
ja: 以下の節では、これらの5つのアドバイスを確認し、例を示し、これらによって開発者がオープン ソースに関わる時にどのように助けになるかを議論します。

source: In the following subsections we provide basic information about such tools and how their use can contribute to compliance activities.
ja: 以下の小節では、ツールに関する情報と、ツール利用がコンプライアンス活動にどのように活用できるかを示します。

source: In the identification and resolution phase, the auditing team inspects and resolves each file or snippet flagged by the scanning tool.
ja: 特定と解決フェーズで、監査チームは、スキャン ツールでフラグをつけられたファイルやコード断片を検査し解決します。

source: In the identification phase of a compliance process, organizations identify all of the components or elements entering the build system, origin, and license information.
ja: コンプライアンス プロセスの特定フェーズでは、組織は、ビルド システムへ入る全てのコンポーネント、その由来、ライセンス情報を特定します。

source: In the legal review phase, the legal counsel (member of the OSRB) reviews reports generated by the scanning tool, the license information of the software component, and any comments left in the compliance ticket by engineers and members of the OSRB.
ja: 法務レビュー フェーズでは、法務担当（OSRBメンバー）は、スキャン ツールによって生成された報告や、ソフトウェア コンポーネントのライセンス情報や、技術者やOSRBメンバーによってコンプライアンス チケットに記載されたコメントをレビューします。

source: In the market, there are multiple commercial/proprietary and open source tools that provide the various functionalities described below.
ja: 市場では、以下で記述するような様々な機能を提供する、複数の商用、プロプライエタリ、オープン ソースのツールがあります。

source: In the past few years, we have witnessed several cases of non-compliance that made their way to the public eye.
ja: この数年で明るみに出たコンプライアンス違反が数件ありました。

source: In the source code scanning phase, all the source code is scanned using a source code scanning tool.
ja: ソース コード スキャン フェーズで、全てのソース コードはソース コード スキャン ツールを使用してスキャンされます。

source: In this author’s experience, BOM difference tools that support open source management
ja: 著者の経験では、オープン ソース管理プロセスを支援するBOM差分ツールは、

source: In this author’s experience, Dependency Mapping tools, much like BOM tools, are usually home-grown and/or built as mash-ups of existing tools and capabilities.
ja: 著者の経験では、依存関係マッピング ツールは、BOMツールとよく似ていますが、通常、自社内製であるか、かつ／または、既存ツールや機能をより集めて作られたものです。

source: In this case, a record is created when the open source component is discovered.
ja: この場合には、オープン ソース コンポーネントが発見された時に、記録が作成されます。

source: In this case, the compliance officer moves the compliance ticket back into the resolution phase, assigning it to a developer to resolve the linkage issue.
ja: このケースでは、コンプライアンス オフィサーは、コンプライアンス チケットを解決フェーズに送り、リンクに関する課題を解決するように開発者に割り当てます。

source: In this case, we assume the fast track, and the compliance ticket for that specific component will be forwarded for legal review.
ja: このケースでは、迅速な処理を想定し、特定のコンポーネントのコンプライアンス チケットは、法務レビューに進められます。

source: In this chapter, we look closely at the role of the Legal Counsel in ensuring open source compliance, and offer practical advice that a Legal Counsel can provide to the software development team.
ja: この章では、オープン ソース コンプライアンスを確実にする法務担当の役割を詳細に見て、法務担当がソフトウェア開発チームに与えることができる実際的なアドバイスを提供します。

source: In this example, the compliance team identifies all open source included in the software baseline (here called v 1.0), and drives all of the open source components through the compliance end-to-end process.
ja: この例では、コンプライアンス チームは、ソフトウェア ベースライン（ここでは仮にV 1.0と呼びます）に含まれる全てのオープン ソースを特定し、オープン ソース コンポーネント全てが、コンプライアンス プロセス全体を通るようにします。

source: In this instance, your organization has incorporated open source into a product or service, and due to the open source component license, you have the obligation to make source code available, including any modifications to it.
ja: この例では、組織は、オープン ソースを製品やサービスに組み込んでおり、オープン ソース コンポーネントライセンスにより、ソース コードに加えた変更を含めて、ソース コードの開示義務を持っています。

source: In this phase, subtasks are closed, and the output is the resolution of all issues.
ja: このフェーズでは、サブタスクはクローズされた上で、全課題の解決がアウトプットとなります。

source: In this scenario, Engineering decides that a software component is not going to be included in the product while the software component is in transit through the compliance process.
ja: このシナリオでは、技術担当は、コンプライアンス プロセスの処理中に、そのソフトウェア コンポーネントが製品に混入しないようにします。

source: In this scenario, legal review uncovered that closely-held intellectual property has been combined with an open source code package.
ja: このシナリオは、法務レビューが、非開示になっている知的財産とオープン ソース コード パッケージとが組み合わされていることを明らかにしたものです。

source: In this scenario, the OSRB decides to reject usage of a specific software component.
ja: このシナリオでは、OSRBは、特定のソフトウェア利用の却下を決定します。

source: In this scenario, the compliance ticket has passed legal review and is now in the architectural and linkages review.
ja: このシナリオでは、コンプライアンス チケットは、法務レビューをパスして、アーキテクチャー レビューとリンク レビューに進みます。

source: In this scenario, the scan report will be attached to the compliance ticket and assigned to the developers who internally own that software component, with a request to rework the code by removing the GPL source code from the proprietary software component.
ja: このシナリオでは、コンプライアンス チケットにスキャン報告が付けられ、プロプライエタリ ソフトウェア コンポーネントからGPLソース コードを取り去るという作業要求と共に、企業内でそのソフトウェア コンポーネントを管理している開発者に作業が割り当てられます。

source: In this scenario, you must ensure the sources have compatible license terms that allow you to join them in a binary or an object file without any conflict.
ja: このシナリオでは、ソースは矛盾を抱えることなしにバイナリやオブジェクトファイルに結合できるような両立性のあるライセンス条件を持つことを確認しなければなりません。

source: In this section, we discuss architecture review and linkage analysis review.
ja: この節では、アーキテクチャー レビューとリンク解析レビューを議論します。

source: In this section, we discuss the inputs and outputs of each of the five phases in the OSRB usage process, as illustrated in Figure 16.
ja: この節では、図16で示されるOSRB利用プロセスの5つのフェーズにおけるインプットとアウトプットについて議論します。

source: In this step of the compliance due diligence, all issues identified during the auditing step are resolved.
ja: コンプライアンス精査のこのステップでは、監査ステップで特定された全ての課題が解決されます。

source: In this step of the compliance due diligence, the OSRB Chair prepares the notices and passes them to the appropriate departments for fulfillment.
ja: コンプライアンス精査の中のこのステップでは、OSRB チェアが通知文を準備し、それを各担当部署に手渡します 。

source: In this step, investigating reported allegations, you should refer to the compliance record for the component in question, review it, and verify if and how the compliance record compares with the inquiry.
ja: この段階では、報告済みの申し立て案件を調査して、問題となっているコンポーネントに関するコンプライアンス記録を参照し、レビューし、コンプライアンス記録と照会とを比較するべきです。

source: In turn, to use compliance as a factor in employee performance reviews, the OSRB must track these issues for each developer:
ja: 逆に、コンプライアンスを従業員の実績評価として利用するためには、OSRBは各担当者の以下の点を追跡しなければなりません。

source: Inappropriate comments have been removed from the source code packages (this is not strictly a compliance issue; however, comments may reveal a compliance issue that is not as visible) .
ja: 不適切なコメントは、ソース コード パッケージから取り除かれている。（厳密には、これはコンプライアンス課題ではありません。しかしながら、コメントは、見えていないコンプライアンス課題を明らかにするかもしれません。）

source: Include a listing of all licenses that correspond to the different open source software included in the product.
ja: 製品に含まれる異なるオープン ソース ソフトウェアに対応する全てのライセンスのリストを含めます。

source: Include compliance checkpoints as part of the software development process as it moves from concept into shipping a product or software stack.
ja: コンプライアンス上のチェックポイントをソフトウェアの開発プロセスに含め、コンセプトが出荷される製品やソフトウェア スタックとなる時に行います。

source: Include compliance in performance reviews; e.g., failure to abide by the compliance policies directly affects employees’ bonuses
ja: 業績評価にコンプライアンスを含める。例えばコンプライアンスポリシーに従わなかったらボーナス査定に直結

source: Include compliance in performance reviews; e.g., failure to abide by the compliance policies directly affects employees’ bonuses Mandate that developers file approval requests early, even if they didn’t yet decide on adoption of OS code
ja: 業績評価にコンプライアンスを含める。例えばコンプライアンスポリシーに従わなかったらボーナス査定に直結 開発者がオープンソースの利用申請を早期に、オープンソースのコード の利用を決める前でも行うよう命令

source: Include open source license information and notices in the product documentation
ja: オープンソース ライセンスの情報と告知を製品の文書の中に含めます

source: Include the open source notices in the product manual or any kind of documentation accompanying the product.
ja: 製品マニュアルや、製品に付属する文書に、オープン ソース通知を含めます。

source: Included packages compile/build properly
ja: 含まれるパッケージは、適切にコンパイル、ビルドできる。

source: Included packages compile/build properly .
ja: 含まれるパッケージは、適切にコンパイル、ビルドできる。.

source: Includes company IP?
ja: 会社IPは含まれるか?

source: Inclusion of open source components into proprietary or third-party source code or vice versa
ja: オープン ソース コンポーネントをプロプライエタリやサード パーティ ソース コードへの挿入、またはその逆。

source: Inclusion of open source components into proprietary or third-party source code or vice versa .
ja: オープン ソース コンポーネントをプロプライエタリやサード パーティ ソース コードへの挿入、またはその逆。

source: Inclusion of proprietary code into an open source component
ja: オープンソースのコンポーネントにプロプラエタリなコードを含めます

source: Inclusion of proprietary code into an open source component Occurs when developers copy/paste proprietary source code into OS software
ja: オープンソースのコンポーネントにプロプラエタリなコードを含めます 開発者がプロプラエタリなソースコードをオープンソースソフトウェアにコピー/ペーストして発生

source: Incoming and outgoing licenses
ja: 入るライセンス、出るライセンス

source: Incoming licenses = Proprietary License + License A + License B + License C
ja: 入るライセンス = プロプライエタリ ライセンス + ライセンスA + ライセンスB + ライセンス

source: Incoming licenses = Proprietary License + License A + License B + License C Outgoing license(s) = ?
ja: 入るライセンス = プロプライエタリ ライセンス + ライセンスA + ライセンスB + ライセンス 出るライセンス = ?

source: Incorporate compliance as part of the development process.
ja: 開発プロセスの一部としてコンプライアンスを組み込み

source: Increasingly, the legal disposition towards non-compliance has lessons to teach open source professionals .
ja: そうしたコンプライアンス違反の法的な決着を通じて、オープンソースのプロフェッショナル達は

source: Incremental compliance
ja: インクリメンタル コンプライアンス
